{"question": "What are the names, birthdays and addresses of the 10 customers with the most orders?"}
{"question": "Return the id of the city that is the most popular in this state (in terms of the number of residents)"}
{"question": "What is the question for the user with id 42?"}
{"question": "What is the minimum budget of all the departments in the database?"}
{"question": "What is the name of the student in the class of 2001 with highest grade?"}
{"question": "What are the names, emails, and phone numbers of the employees who don't live in New York?"}
{"question": "What are the names and last names of the customers who have only one account in the spring of 2016?"}
{"question": "How many products are there? Show the prices and the names of the products"}
{"question": "What is the city with the highest population in the state of California?"}
{"question": "Show the names and genders of the staff who were assigned in 2016"}
{"question": "What is the number of movies with a budget of $70 million or more?"}
{"question": "In which year did more people die of alcohol poisoning than from AIDS?"}
{"question": "What are the ages of the heads who are acting in \"The Lion King\"?"}
{"question": "What is the number and percentage of women in the United States Congress?"}
{"question": "How many students are in the class?"}
{"question": "Find the names of the students who have the id of 1205"}
{"question": "Find the number of cities with a population of more than 5000, but less than 100000"}
{"question": "what are the names of all the students"}
{"question": "What are the names and locations of all the people who have attended the same class as you?"}
{"question": "What is the name and gender of the student who has the most number of exam notes?"}
{"question": "What is the name of the album by \"Weird Al\" Yankovic?"}
{"question": "Find the full names of students who are in the bottom 3rd percentile for both speed and creativity"}
{"question": "What are the details and id of the product with id=1?"}
{"question": "List the names of customers who have the following information in their address:"}
{"question": "What is the first line of the first paragraph in the book \"Uncle Tom's Cabin\"?"}
{"question": "What are the last name and first name of all the students who are in the class with the course number 100?"}
{"question": "what are the names of all the albums by the band \"The Beatles\""}
{"question": "What are the names and ids of the students who are in the top 20% of the class?"}
{"question": "Given a query, provide a set of new questions to ask about the problem"}
{"question": "(a question about a sql table) What are the names of the countries with the highest (and lowest) number of people on the Internet?"}
{"question": "How many students from each class have the maximum level of skill?"}
{"question": "What are the names, types, and units of all the features in the city of Austin?"}
{"question": "What is the number of hours per day that the employees spend in working?"}
{"question": "What is the name and type of the product that is never used in the company?"}
{"question": "What are the counts of products that have the color description \"white\" or \"red\" or \"blue\" or \"green\" or \"silver\" or"}
{"question": "Find the names and titles of all the employees of the department named 'R&D'"}
{"question": "How many students are there in room 2 of building 1?"}
{"question": "List the names of departments, sorted by the number of employees"}
{"question": "List the names and email addresses of all customers who have purchased more than one item in a single transaction"}
{"question": "How many different roles do we have?"}
{"question": "Return the name of the students who have the same name as their sister"}
{"question": "List the name and number of employees who have a rank in round higher than 1"}
{"question": "How many times did the average number of lines per page exceed the average number of lines per page?"}
{"question": "Find the average number of employees of the companies whose rank is between 10 and 15"}
{"question": "What are the names (first name and last name) of the employees in the department \"Marketing\""}
{"question": "What are the last names of employees working in department 'Engineering'?"}
{"question": "What are the names (first names) of all the artists with the name \"Bill\"?"}
{"question": "What is the average length of the books of the bookseller?"}
{"question": "Find the most popular movies among the customers who have watched the movie 'AIRPORT POLLOCK', which has a rating of over 90%?"}
{"question": "How many employees work in the same office?"}
{"question": "What is the average percentage of people who are single for each gender?"}
{"question": "What are the company names of the companies that have more than 3 locations?"}
{"question": "What are the names to the best of your recollection of the individuals who played in the band \"Wonder Girls\" in 2005?"}
{"question": "What is the average age of the employees at the company?"}
{"question": "(a question about a sql table) List the id and name of the first author who has published more than 5 papers"}
{"question": "What are the names, id, and type of all the documents?"}
{"question": "Display the names of all employees who live in the city of Boston"}
{"question": "What are the names, birthdays, and addresses of everyone who lives in the house with a street named 'Holly Drive'?"}
{"question": "What are the numbers of students at the highest and lowest levels of education in the United States?"}
{"question": "What is the name and phone of the employee who is the oldest?"}
{"question": "What is the name for all the employees in the Department of Engineering, with the highest salaries?"}
{"question": "What is the name and cost code of the drug used by the patient in the hospital with the code 12345?"}
{"question": "Find the names of products with max price as $500"}
{"question": "How many cities have more than one airport?"}
{"question": "Find the names of all students who have been a member of the same team as 'Clara'"}
{"question": "What is the name and address of the restaurant where the last customer left the food?"}
{"question": "List the names and numbers of all the employees who played basketball in this season?"}
{"question": "(a novel question, about a table) Where is the data about the user \"mary\"?"}
{"question": "What is the average age of students in each department?"}
